package by.jonline.grow.programmingwithclass.exercise15;

/**
 * Туристические путевки. Сформировать набор предложений клиенту по выбору
 * туристической путевки различного типа (отдых, экскурсии, лечение, шопинг,
 * круиз и т. д.) для оптимального выбора. Учитывать возможность выбора
 * транспорта, питания и числа дней. Реализовать выбор и сортировку путевок.
 */
public class AggregationAndComposition {
	public static void main(String[] args) {

		Tour[] tour = new Tour[14];

		tour[0] = new Tour("отдых1", "машина1", "все включено1", 25, 50.51);
		tour[1] = new Tour("отдых2", "машина1", "все включено1", 15, 50.49);
		tour[2] = new Tour("отдых3", "машина1", "все включено2", 5, 50.4);
		tour[3] = new Tour("отдых4", "машина1", "все включено3", 53, 50.0);
		tour[4] = new Tour("отдых6", "машина3", "все включено3", 52, 50.560);
		tour[5] = new Tour("отдых1", "машина2", "все включено1", 51, 50.5234);
		tour[6] = new Tour("отдых1", "машина1", "все включено1", 54, 50.5324);
		tour[7] = new Tour("отдых2", "машина3", "все включено1", 35, 50.55);
		tour[8] = new Tour("отдых3", "машина2", "все включено2", 75, 50.59);
		tour[9] = new Tour("отдых4", "машина2", "все включено2", 35, 50.51);
		tour[10] = new Tour("отдых4", "машина1", "все включено3", 15, 50.10);
		tour[11] = new Tour("отдых11", "машина1", "все включено1", 35, 50.60);
		tour[12] = new Tour("отдых1", "машина1", "все включено1", 51, 50.20);
		tour[13] = new Tour("отдых1", "машина1", "все включено1", 55, 50.510);

		Company com = new Company(tour);

		com.sortByCost();
		com.getTour("отдых1", "", "все включено1", 0, -10);

		System.out.println("----------");
		com.sortByDay();
		com.out();
	}
}
